#include "stdio.h"
#include "stdlib.h"

int main()
{
	float a[200] = { 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 }, max, min;
	int n, i, j = 0;
	printf("请输入一维数组的长度（最多支持200个数）：");
	scanf_s("%d", &n);
	if (n > 200 || n <= 0)
	{
		n = 10;
		printf("您输入的数不合法，已定义为10。\n");
		system("pause");
	}
	system("cls");
	for (i = 0; i < n; i++)
	{
		printf("请定义数组的第%d个数：", i + 1);
		scanf_s("%f", &a[i]);
		system("cls");
	}
	max = a[0];
	min = a[0];
	for (i = 0; i < n; i++)
	{
		if (a[i] > max)
			max = a[i];
		if (a[i] < min)
			min = a[i];
	}
	printf("所输入的数组中，最大值为%f，最小值为%f。\n请按任意键退出本程序。\n\n", max, min);
	system("pause>nul");
	return 0;
}